Tekla Open API Reference for Tekla Structures 2025
ControlCircle Constructor (Point, Point, Point)
 Initializes a new instance of the ControlCircle class. The control circle is not magnetic.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlCircle(
	Point point1,
	Point point2,
	Point point3
)
Public Sub New (
	point1 As Point,
	point2 As Point,
	point3 As Point
)
Parameters
point1
Type: Tekla.Structures.Geometry3d.Point
 The first point to be used.
point2
Type: Tekla.Structures.Geometry3d.Point
 The second point to be used.
point3
Type: Tekla.Structures.Geometry3d.Point
 The third point to be used.
See Also
Reference
ControlCircle Class
ControlCircle Overload
Tekla.Structures.Model Namespace